tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/inc/hw_hrpwm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the DCBHTRIPSEL register
//
//*****************************************************************************
#define HRPWM_DCBHTRIPSEL_TRIPINPUT1  0x1U         // Trip Input 1 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT2  0x2U         // Trip Input 2 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT3  0x4U         // Trip Input 3 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT4  0x8U         // Trip Input 4 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT5  0x10U        // Trip Input 5 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT6  0x20U        // Trip Input 6 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT7  0x40U        // Trip Input 7 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT8  0x80U        // Trip Input 8 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT9  0x100U       // Trip Input 9 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT10  0x200U       // Trip Input 10 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT11  0x400U       // Trip Input 11 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT12  0x800U       // Trip Input 12 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT14  0x2000U      // Trip Input 14 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT15  0x4000U      // Trip Input 15 Select to DCBH
                                               // Mux

//*****************************************************************************
//
// The following are defines for the bit fields in the DCBLTRIPSEL register
//
//*****************************************************************************
#define HRPWM_DCBLTRIPSEL_TRIPINPUT1  0x1U         // Trip Input 1 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT2  0x2U         // Trip Input 2 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT3  0x4U         // Trip Input 3 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT4  0x8U         // Trip Input 4 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT5  0x10U        // Trip Input 5 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT6  0x20U        // Trip Input 6 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT7  0x40U        // Trip Input 7 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT8  0x80U        // Trip Input 8 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT9  0x100U       // Trip Input 9 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT10  0x200U       // Trip Input 10 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT11  0x400U       // Trip Input 11 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT12  0x800U       // Trip Input 12 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT14  0x2000U      // Trip Input 14 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT15  0x4000U      // Trip Input 15 Select to DCBL
                                               // Mux
#endif
